{"Solution Policy":"\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission159\/solnPolicy.json","Explanation":"I'm planning to follow this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission159\/solnPolicy.json]. It is expected to have 1.0 collision (0.1 in cost); take 126.2135904358939 minutes (2.569732545421049 in cost); and be very-intrusive 0.0 step, somewhat-intrusive 7.0 steps, and non-intrusive 5.0 steps (0.4666666666666666 in cost).\n\nAlternatively, following this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission159\/altPolicy1.json] would reduce the intrusiveness to very-intrusive 0.0 step, somewhat-intrusive 6.0 steps, and non-intrusive 6.0 steps (-0.06666666666661225 in cost). However, I didn't choose that policy because it would increase the collision to 1.399999999999856 collisions (+0.0399999999999856 in cost), and increase the time to 133.9517193635163 minutes (+0.15754976684603061 in cost). The decrease in intrusiveness is not worth the increase in collision, and the increase in time.\n\nAlternatively, following this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission159\/altPolicy2.json] would reduce the time to 124.83171368106508 minutes (-0.028135271791099203 in cost). However, I didn't choose that policy because it would increase the intrusiveness to very-intrusive 3.0 steps, somewhat-intrusive 5.0 steps, and non-intrusive 5.0 steps (+0.46666666666659856 in cost), and increase the collision to 1.5999999999997407 collisions (+0.059999999999974074 in cost). The decrease in time is not worth the increase in intrusiveness, and the increase in collision.\n\nAlternatively, following this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission159\/altPolicy3.json] would reduce the collision to 0.6000000000000997 collision (-0.03999999999999004 in cost). However, I didn't choose that policy because it would increase the time to 137.23669967962942 minutes (+0.22443258667731492 in cost). The decrease in collision is not worth the increase in time.","Mission":"mission159.json","Alternative Policies":["\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission159\/altPolicy1.json","\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission159\/altPolicy2.json","\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission159\/altPolicy3.json"]}