{"Solution Policy":"\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission175\/solnPolicy.json","Explanation":"I'm planning to follow this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission175\/solnPolicy.json]. It is expected to have 1.5999999999999999 collisions (0.16 in cost); take 133.0352840001666 minutes (2.361055055963617 in cost); and be non-intrusive 10.0 steps, somewhat-intrusive 0.0 step, and very-intrusive 2.0 steps (0.4 in cost).\n\nAlternatively, following this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission175\/altPolicy1.json] would reduce the collision to 1.3999999999999595 collisions (-0.020000000000004042 in cost), and reduce the intrusiveness to non-intrusive 12.0 steps, somewhat-intrusive 2.0 steps, and very-intrusive 1.0 step (-0.0666666666666284 in cost). However, I didn't choose that policy because it would increase the time to 152.86788624034864 minutes (+0.35198080076288996 in cost). The decrease in collision, and the decrease in intrusiveness are not worth the increase in time.\n\nAlternatively, following this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission175\/altPolicy2.json] would reduce the collision to 1.4 collisions (-0.020000000000000018 in cost), and reduce the time to 127.86288178347002 minutes (-0.09179764975127691 in cost). However, I didn't choose that policy because it would increase the intrusiveness to non-intrusive 6.0 steps, somewhat-intrusive 5.0 steps, and very-intrusive 1.0 step (+0.13333333333333341 in cost). The decrease in collision, and the decrease in time are not worth the increase in intrusiveness.","Mission":"mission175.json","Alternative Policies":["\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission175\/altPolicy1.json","\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission175\/altPolicy2.json"]}