{"Solution Policy":"\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission5\/solnPolicy.json","Explanation":"I'm planning to follow this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission5\/solnPolicy.json]. It is expected to have 1.4 collisions (0.42 in cost); take 138.82304933113022 minutes (1.4078708086286609 in cost); and be non-intrusive 10.0 steps, somewhat-intrusive 0.0 step, and very-intrusive 2.0 steps (0.6 in cost).\n\nAlternatively, following this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission5\/altPolicy1.json] would reduce the collision to 1.2 collisions (-0.06 in cost). However, I didn't choose that policy because it would increase the time to 145.16268394978002 minutes (+0.0642932608091562 in cost). The decrease in collision is not worth the increase in time.\n\nAlternatively, following this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission5\/altPolicy2.json] would reduce the collision to 1.2000000000000544 collisions (-0.05999999999998368 in cost), and reduce the intrusiveness to non-intrusive 12.0 steps, somewhat-intrusive 2.0 steps, and very-intrusive 1.0 step (-0.09999999999989195 in cost). However, I didn't choose that policy because it would increase the time to 158.65565157126676 minutes (+0.20113188614976174 in cost). The decrease in collision, and the decrease in intrusiveness are not worth the increase in time.\n\nAlternatively, following this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission5\/altPolicy3.json] would reduce the time to 133.03528400038002 minutes (-0.05869649093300122 in cost). However, I didn't choose that policy because it would increase the collision to 1.5999999999999999 collisions (+0.05999999999999994 in cost). The decrease in time is not worth the increase in collision.","Mission":"mission5.json","Alternative Policies":["\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission5\/altPolicy1.json","\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission5\/altPolicy2.json","\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission5\/altPolicy3.json"]}