{"Solution Policy":"\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission11\/solnPolicy.json","Explanation":"I'm planning to follow this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission11\/solnPolicy.json]. It is expected to have 0.6000000000000001 collision (0.24000000000000005 in cost); take 154.52636932070166 minutes (1.821982419440202 in cost); and be non-intrusive 8.0 steps, somewhat-intrusive 3.0 steps, and very-intrusive 3.0 steps (0.8 in cost).\n\nAlternatively, following this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission11\/altPolicy1.json] would reduce the intrusiveness to non-intrusive Infinity steps, somewhat-intrusive Infinity steps, and very-intrusive Infinity steps (-0.06666666666666643 in cost), and reduce the collision to 0.56 collision (-0.016000000000000014 in cost). However, I didn't choose that policy because it would increase the time to 167.05056163158002 minutes (+0.1476696715804584 in cost). The decrease in intrusiveness, and the decrease in collision are not worth the increase in time.\n\nAlternatively, following this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission11\/altPolicy2.json] would reduce the intrusiveness to non-intrusive 8.0 steps, somewhat-intrusive 2.0 steps, and very-intrusive 3.0000000000000004 steps (-0.06666666667237509 in cost), and reduce the time to 151.15620739397826 minutes (-0.039736750485692696 in cost). However, I didn't choose that policy because it would increase the collision to 0.9999999999943345 collision (+0.1599999999977338 in cost). The decrease in intrusiveness, and the decrease in time are not worth the increase in collision.","Mission":"mission11.json","Alternative Policies":["\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission11\/altPolicy1.json","\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission11\/altPolicy2.json"]}