{"Solution Policy":"\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission168\/solnPolicy.json","Explanation":"I'm planning to follow this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission168\/solnPolicy.json]. It is expected to have 0.6000000000000001 collision (0.06000000000000001 in cost); take 122.54187589912391 minutes (1.988409051600169 in cost); and be somewhat-intrusive 5.0 steps, non-intrusive 6.0 steps, and very-intrusive 1.0 step (0.2666666666666667 in cost).\n\nAlternatively, following this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission168\/altPolicy1.json] would reduce the time to 120.60902734137329 minutes (-0.031363103750488674 in cost). However, I didn't choose that policy because it would increase the intrusiveness to somewhat-intrusive 6.0 steps, non-intrusive 6.0 steps, and very-intrusive 1.0 step (+0.03333333333331645 in cost), and increase the collision to 0.8000000000004739 collision (+0.020000000000047383 in cost). The decrease in time is not worth the increase in intrusiveness, and the increase in collision.\n\nAlternatively, following this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission168\/altPolicy2.json] would reduce the intrusiveness to somewhat-intrusive 6.0 steps, non-intrusive 8.0 steps, and very-intrusive 0.0 step (-0.06666666666648369 in cost). However, I didn't choose that policy because it would increase the time to 126.73329213851702 minutes (+0.06801144448199814 in cost). The decrease in intrusiveness is not worth the increase in time.\n\nAlternatively, following this policy [\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission168\/altPolicy3.json] would reduce the time to 117.60063079346062 minutes (-0.08017844040811006 in cost), and reduce the collision to 0.4000000000002001 collision (-0.01999999999998 in cost). However, I didn't choose that policy because it would increase the intrusiveness to somewhat-intrusive 5.0 steps, non-intrusive 4.0 steps, and very-intrusive 3.0 steps (+0.20000000000045837 in cost). The decrease in time, and the decrease in collision are not worth the increase in intrusiveness.","Mission":"mission168.json","Alternative Policies":["\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission168\/altPolicy1.json","\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission168\/altPolicy2.json","\/Users\/rsukkerd\/Projects\/explainable-planning\/XPlanningEvaluation\/output\/policies\/mission168\/altPolicy3.json"]}